#+TITLE:       Narrow and Phantom: California Health Insurance Networks
#+AUTHOR:      Thomas Moulia
#+EMAIL:       jtmoulia@gmail.com
#+DATE:        2015-06-01 Mon
#+URI:         /blog/%y/%m/%d/narrow-and-phantom
#+KEYWORDS:    health insurance,data,california,health
#+TAGS:        health
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: The Anthem Minimum Coverage PPO network is not what's advertised.

/Overview:/ health insurance plans have out of date physician listings. Why is
that, and how might we fix it?

*** Unable to Contact

#+BEGIN_SRC python
  len(raw[raw['Contacted?'].notnull()])
#+END_SRC

#+RESULTS:
: 11

11 physicians who couldn't be contacted due to reaching an answering machine or
requiring follow-up were removed.

*** No Listed Physicians for Zip Code

#+BEGIN_SRC python
  len(raw[raw['Phone'].isnull()])
#+END_SRC

#+RESULTS:
: 16

16 zipcodes had had no listed physicians. These records were removed.


*** Number of Physicians Considered

#+BEGIN_SRC python
  len(docs)
#+END_SRC

#+RESULTS:
: 33

*** Valid Physicians

A valid physician is one who had valid contact information, and was
a primary care physician accepting new patients.

#+BEGIN_SRC python
  def iter_valid(docs, fields=['Contact Correct?',
                               'Specialty Correct?',
                               'Insurance Correct?',
                               'New Patients?']):
      """
      Yield physicians for which the specified fields are True.
      """
      for _, doc in docs.iterrows():
          if all(doc[field] is True for field in fields):
              yield doc

  valid_docs = list(iter_valid(docs))
  len(valid_docs)
#+END_SRC

#+RESULTS:
: 7

*** Percentage of Valid Physicians

#+BEGIN_SRC python
  float(len(valid_docs)) / float(len(docs))
#+END_SRC

#+RESULTS:
: 0.212121212121

21.2% valid out of 33 physicians contacted.
